/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   my_pwd.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nagrivan <nagrivan@21-school.ru>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/07 16:11:11 by nagrivan          #+#    #+#             */
/*   Updated: 2021/09/07 16:40:37 by nagrivan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

/*подумать над тем, что может принять в себя функция,
+ подумать над возвращаемым значением и как печатать ошибку
(оригинальная функция возвращает 0 при успехе 
и >0 (код ошибки, по факту) при неудаче)*/

int	my_pwd(void)
{
	char	*pwd;
	
	pwd = getcwd(pwd, 1024);
	if (!pwd)
		return (1);
	ft_putendl_fd(pwd, 1);
	return (0);
}